package Ch06_sec01;

public class ObjectOrientedProgramming {

	public static void main(String[] args) {

	}

}
// 객체 : 물리적으로 존재하거나 추상적으로 생각할 수 있는 것 중에서 
//		 자신의 속성을 가지고 있으면서 식별 가능한 것
//		 속성 (필드) + 동작 (메소드)
// 객체 모델링 : 현실 세계의 객체를 소프트웨어 객체로 설계하는 것
// 객체의 상호작용 : 객체는 독립적으로 존재하고 다른 객체와 서로 상호작용하면서 동작,
//				  상호작용 수단은 메소드
// 메소드 호출 : 객체가 다른 객체의 기능을 이용하는 것
// 객체 간의 관계 : 집합 관계, 사용 관계, 상속 관계
// 집합 관계 : 하나는 부품이고 하나는 완성품에 해당
// 사용 관계 : 객체 간의 상호작용
// 상속 관계 : 상위 객체를 기반으로 하위 객체를 생성하는 관계
// 클래스 : 객체를 생성하기 위한 필드와 메소드가 정의
// 인스턴스 : 클래스로부터 만들어진 객체
// 클래스의 구성 멤버 : 필드, 생성자, 메소드
// 필드 : 객체의 데이터가 저장되는 곳
// 생성자 : 객체 생성 시 초기화 역할 담당
// 메소드 : 객체의 동작에 해당하는 블록 실행